{
    "title": "Cài đặt môi trường lập trình C++",
    "desicription": "C++ là ngôn ngữ lập trình có mục đích và được sử dụng rộng rãi hiện nay. Ngôn ngữ lập trình này bao gồm các tính năng lập trình mệnh lệnh (imperative programing), ngôn ngữ lập trình hướng đối tượng và ngôn ngữ lập trình khái quát. Trong bài học C++ này eLib.VN sẽ hướng dẫn bạn cách cài đặt môi trường C++. Cùng theo dõi nhé!",
    "img": "https://www.elib.vn/images/doc/2020/20201026//thumb/600x254/cai-dat-moi-truong-lap-trinh-c-271.jpg",
    "content": "\n              <div id=\"1\">\n<h2 id=\"goto-h2-1\">1. Các công cụ cần thiết</h2>\n</div>\n\n<p>Nếu bạn muốn&nbsp;cài đặt môi trường lập trình C++, bạn cần hai công cụ phần mềm sau đây trên máy tính của bạn: Trình soạn thảo văn bản và trình biên dịch C++.</p>\n\n<p id=\"goto-h3-1\"><strong>Trình soạn thảo văn bản</strong></p>\n\n<p>Điều này sẽ được sử dụng để nhập chương trình của bạn. Ví dụ về một số trình soạn thảo bao gồm Windows Notepad, lệnh Chỉnh sửa Hệ điều hành, Tóm tắt, Epsilon, EMACS và vim hoặc vi.</p>\n\n<p>Tên và phiên bản của trình soạn thảo văn bản có thể khác nhau trên các hệ điều hành khác nhau. Ví dụ, Notepad sẽ được sử dụng trên Windows, và vim hoặc vi có thể được sử dụng trên các cửa sổ cũng như trên Linux hoặc UNIX.</p>\n\n<p>Các tệp bạn tạo với trình biên tập của bạn được gọi là các tệp nguồn và chứa các mã nguồn của chương trình. Các tập tin nguồn cho các chương trình C thường được đặt tên với phần mở rộng \".c\".</p>\n\n<p>Trước khi bắt đầu lập trình, hãy chắc chắn rằng bạn có một trình soạn thảo văn bản và bạn có đủ kinh nghiệm để viết một chương trình máy tính, lưu nó trong một tệp, biên dịch nó và cuối cùng thực hiện nó.</p>\n\n<p id=\"goto-h3-2\"><strong>Trình biên dịch C++</strong></p>\n\n<p>Mã nguồn được viết bằng tệp mã nguồn là nguồn có thể đọc được của con người cho chương trình của bạn. Nó cần phải được \"biên dịch\", vào ngôn ngữ máy để CPU của bạn thực sự có thể thực hiện chương trình theo các hướng dẫn được đưa ra.</p>\n\n<p>Trình biên dịch biên dịch mã nguồn vào các chương trình thực thi cuối cùng. Trình biên dịch được sử dụng thường xuyên nhất và miễn phí là trình biên dịch GNU C/C++, nếu không bạn có thể có trình biên dịch từ HP hoặc Solaris nếu bạn có hệ điều hành tương ứng.</p>\n\n<p>Phần sau giải thích cách cài đặt trình biên dịch GNU C/C++ trên các hệ điều hành khác nhau. Chúng tôi tiếp tục đề cập đến C/C++ với nhau vì GNU gcc trình biên dịch hoạt động cho cả C và C++ ngôn ngữ lập trình.</p>\n\n<div id=\"2\">\n<h2>2. Cài đặt môi trường lập trình C++</h2>\n</div>\n\n<p><strong>Cài đặt trên UNIX/Linux</strong></p>\n\n<p>Nếu bạn đang sử dụng Linux hoặc UNIX , hãy kiểm tra xem GCC đã được cài đặt trên hệ thống của bạn bằng cách nhập lệnh sau từ dòng lệnh:</p>\n\n<div>\n<pre><code class=\"language-cpp hljs\">$ gcc -v</code></pre>\n</div>\n\n<p>Nếu bạn có trình biên dịch GNU được cài đặt trên máy của bạn thì bạn nên in một thông báo như sau:</p>\n\n<div>\n<pre><code class=\"hljs apache\"><span class=\"hljs-attribute\">Using</span> built-in specs.\n<span class=\"hljs-attribute\">Target</span>: i<span class=\"hljs-number\">386</span>-redhat-linux\n<span class=\"hljs-attribute\">Configured</span> with: ../configure --prefix=/usr .......\n<span class=\"hljs-attribute\">Thread</span> model: posix\n<span class=\"hljs-attribute\">gcc</span> version <span class=\"hljs-number\">4</span>.<span class=\"hljs-number\">1</span>.<span class=\"hljs-number\">2</span> <span class=\"hljs-number\">20080704</span> (Red Hat <span class=\"hljs-number\">4</span>.<span class=\"hljs-number\">1</span>.<span class=\"hljs-number\">2</span>-<span class=\"hljs-number\">46</span>)</code></pre>\n</div>\n\n<p>Hướng dẫn này đã được viết dựa trên Linux và tất cả các ví dụ đưa ra đã được biên dịch trên hương vị Cent OS của hệ thống Linux.</p>\n\n<p id=\"goto-h3-4\"><strong>Cài đặt trên Mac OS</strong></p>\n\n<p>Nếu bạn sử dụng Mac OS X, cách dễ nhất để lấy GCC là tải về môi trường phát triển Xcode từ trang web của Apple và làm theo hướng dẫn cài đặt đơn giản. Một khi bạn đã thiết lập Xcode, bạn sẽ có thể sử dụng trình biên dịch GNU cho C/C++.</p>\n\n<p id=\"goto-h3-5\"><strong>Cài đặt trên Windows</strong></p>\n\n<p>Để cài đặt GCC trên Windows, bạn cần cài đặt MinGW. Để cài đặt MinGW, hãy truy cập vào trang chủ của MinGW,&nbsp;<a href=\"http://www.mingw.org/\" target=\"_blank\">www.mingw.org</a>&nbsp;và làm theo liên kết tới trang download MinGW. Tải về phiên bản mới nhất của chương trình cài đặt MinGW, có tên MinGW-&nbsp;<version>.exe.</version></p>\n\n<p>Trong khi cài đặt Min GW, ở mức tối thiểu, bạn phải cài đặt gcc-core, gcc-g++, binutils và thời gian chạy MinGW, nhưng bạn có thể muốn cài đặt thêm.</p>\n\n<p>Thêm thư mục con bin của cài đặt MinGW vào biến môi trường PATH của bạn , để bạn có thể chỉ định các công cụ này trên dòng lệnh bằng các tên đơn giản của chúng.</p>\n\n<p>Sau khi quá trình cài đặt hoàn tất, bạn có thể chạy gcc, g++, ar, ranlib, dlltool và một số công cụ GNU khác từ dòng lệnh Windows.</p>\n\n<p><strong>Phần mềm Dev C++</strong></p>\n\n<p>Nếu bạn đang sử dụng hệ điều hành Windows bạn có thể sử dụng phần mềm&nbsp;Dev C++, khi cài phần mềm Dev C++ cung cấp cho bạn&nbsp;trình soạn thảo văn bản, trình biên dịch C/C++, tính năng debug và nhiều tính năng tiện lợi khác.</p>\n\n<p>Giao diện ban đầu của phần mềm Dev C++:</p>\n\n<p style=\"text-align: center;\"><img alt=\"Cài đặt môi trường lập trình C++\" src=\"https://s.elib.vn/images/fckeditor/upload/2020/20201026/images/C%C3%A0i%20%C4%91%E1%BA%B7t%20m%C3%B4i%20tr%C6%B0%E1%BB%9Dng.png\" style=\"width: 550px; height: 310px;\"><p class=\"notepic\">Cài đặt môi trường lập trình C++</p></p>\n\n<p><strong>Phần mềm Turbo C++</strong></p>\n\n<p>Giao diện ban đầu của phần mềm Turbo C++ khá là tù:</p>\n\n<p style=\"text-align: center;\"><img alt=\"\" src=\"https://s.elib.vn/images/fckeditor/upload/2020/20201026/images/cai-dat-moi-truong-lap-trinh-c-_1603704840.png\" style=\"width: 550px; height: 300px;\"></p>\n\n<p>Trên đây là bài viết của eLib.VN về&nbsp;Cài đặt môi trường lập trình C++. Chúng tôi hy vọng, bài viết hữu ích cho những bạn có đam mê và muốn phát triển cùng ngôn ngữ lập trình C++. Chúc các bạn thành công!</p>\n\n\n\n\n\n\n\n\n\n              "
}